from turtle import * # აქ მე კომპიუტერს მივეცი დავალება from turtle import 

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(-300,-300)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

speed(30) #აქ მე კომპიუტერს მივეცი დავალება რომ მან სისწრსფე გაზარდოს სისწრაფე
width(5) #აქ მე კომპიუტერს მივეცი დავალება width 
color("gray") # აქ მე ნახატს მივეცი ფერი დავალებით color
begin_fill() #aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
forward(600) # აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(300)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(150)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(100)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)## აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(300)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(100)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(150)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(300)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოსც
goto(-150,0)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

begin_fill()#aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
left(180)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(40)# აქ კომპიუტერს მივეცი დავალება "forward"

left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"


left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(300,0)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

left(180)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(40)# აქ კომპიუტერს მივეცი დავალება "forward"

left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"


left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(-150,0)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს


left(180)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(150)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
begin_fill()#aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
color("green")# აქ მე ნახატს მივეცი ფერი დავალებით color
forward(80)# აქ კომპიუტერს მივეცი დავალება "forward"

right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(40)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(80)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს

goto(-150,115)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

right(180)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(10)# აქ კომპიუტერს მივეცი დავალება "forward"
color("black")# აქ მე ნახატს მივეცი ფერი დავალებით color
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(10)# აქ კომპიუტერს მივეცი დავალება "forward"
forward(15)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(13)# აქ კომპიუტერს მივეცი დავალება "forward"

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს

goto(-140,115)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

forward(13)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(8)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(5)# აქ კომპიუტერს მივეცი დავალება "forward"

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს

goto(-120,115)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(13)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(13)# აქ კომპიუტერს მივეცი დავალება "forward"

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(-100,115)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

right(110)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(25)# აქ კომპიუტერს მივეცი დავალება "forward"
right(130)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(26)# აქ კომპიუტერს მივეცი დავალება "forward"
right(180)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(10)# აქ კომპიუტერს მივეცი დავალება "forward"
left(70)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(13)# აქ კომპიუტერს მივეცი დავალება "forward"

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(-200,-100)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

begin_fill()#aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
right(100)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(60)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(60)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(250,-100)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

begin_fill()#aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
right(270)# აქ კომპიუტერს მივეცი დავალება რომ მან მარჯვნივ მოუხვიოს 
forward(60)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(30)# აქ კომპიუტერს მივეცი დავალება "forward"
left(60)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(60)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(50)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს

penup()# აქ კომპიუტერს მივეცი დავალება penup რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
goto(0,-300)# აქ კომპიუტერს მივეცი დავალება goto რამაც მისცა საშვალება კალამი სხვა ადგილას გადაიტანოს
pendown()# აქ კომპიუტერს მივეცი დავალება pendown რამაც მისცა საშვალება კალამმა ხატვა გააგრძელოს

begin_fill()#aq me cmpiuters მივეცი დავალება რომ მან დაიწყოს შევსება "begin_fill"
color('brown')# აქ მე ნახატს მივეცი ფერი დავალებით color
forward(70)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(150)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(140)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(150)# აქ კომპიუტერს მივეცი დავალება "forward"
left(90)# აქ კომპიუტერს მივეცი დავალება რომ მან მარცხნივ მოუხვიოს მარცხნივ
forward(70)# აქ კომპიუტერს მივეცი დავალება "forward"
end_fill()#აქ მე კომპიუტერს მივეცი დავალება end_fill იმისატვის რომ მან შევსება დაამთავროს
exitonclick()# აქ მე კომპიუტერს მივეცი დავალება exitonclick