name = "davit"#მე შევქმენი ცვლადი სახელად name და მივანიჭე მნიშვნელობა "davit"

surename = "tsintsadze"#მე შევქმენი ცვლადი სახელeად surename და მივანიჭე მნიშვნელობა "tsintsadze"

age = 13#მე შევქმენი str სახელად age და მივანიჭე მნიშვნელობა "13"

hobby = "programing"#მე შევქმენი ცვლადი სახელად hobby და მივანიჭე მნიშვნელობა "programing"

country = "georgia"#მე შევქმენი ცვლადი სახელად country და მივანიჭე მნიშვნელობა "georgia"

print(name) #პრინტის საშვალებით კომპიუტერს მივეცი ბრძანება print  და მან  ეკრანზე გამოიყვანა

print(surename)#პრინტის საშვალებით კომპიუტერს მივეცი ბრძანება print  და მან surename ეკრანზე გამოიყვანა


print(age)#პრინტის საშვალებით კომპიუტერს მივეცი ბრძანება print  და მან age ეკრანზე გამოიყვანა


print(hobby)#პრინტის საშვალებით კომპიუტერს მივეცი ბრძანება print  და მან hobby ეკრანზე გამოიყვანა


print(country)#პრინტის საშვალებით კომპიუტერს მივეცი ბრძანება print  და მან country ეკრანზე გამოიყვანა


print(name + " " + surename + " " + str(age) + " " + hobby + " " + country) 
#აქ პრინტის საშვალებით ყველა ცვლადი გავერთიანე ;)

